{
		"the black Land" : "Mordor",
		"the great river" : "the river Anduin; largest river in Middle-earth",
		"necromancer" : "an evil wizard specializing in death magic",
		"oliphaunt" : "a large predecessor to an elephant",
		"palantìr" : "one of eight crystal balls, linked to each other, that enable communication across great distances",
		"uruk-hai" : "name of the orcs of Saruman; they have human blood, are especially large, and can endure daylight",
		"the four farthings" : "divisions of the Shire, similar to counties",
		"halfling" : "another term for hobbit",
		"mallorn"  : "a tree unique to Lothlórien; its leaves turn gold in the fall but do not drop until spring, when the tree puts on yellow flowers",
		"the nine" : "the Nazgûl, most powerful servants of Sauron; also refers to the rings of men, which enslaved them",		
		"the seven" :  "the rings of the Dwarves, cursed by Sauron",
		"the third age" :  "the time of the story, beginning with the Isildur's defeat of Sauron and ending with the destruction of the One Ring",
		"elanor" :  "a small yellow flower growing in Lothlórien",
		"balrog" : "A demon re-awakened from ancient times by the Dwarves mining in Moria",
		"dunedain" : "The name given to the men of Numenor and their descendants in Middle-Earth. It means Men of the West",
		"dwarf" : "A short, typically around four foot, stout, bearded being prone to mining and metallurgy",
		"glamdring" : "Gandalf's sword. An Elven blade forged in the First Age that was found by Gandalf in a Troll's cave",
		"isildur" : "The man who defeated at the end of the Second Age by cutting the Ring from his finger. Died soon after",
		"orthanc" : "Saruman's tower in Isengard",
		"narsil" : "Elendil's sword that was broken, the hilt shard was used by his heir Isildur to cut the ring from Sauron",
		"sting" : "Frodo's sword, given to him by Bilbo, who found it in a Troll's cave. It is an Elven dagger forged in the First Age",
		"yrch" : "The Sindarin word for orcs",
		"orodruin" : "Mount Doom, the Fiery Mountain. This is where the Ring was forged and where it must be destroyed",
		"elendil" : "High King of Arnor and Gondor, father of Isildur. He led an army of men in the Last Alliance of Men and Elves against Sauron at the end of the Second Age. He was killed in the battle",
		"eru" : "The one. God. The creator of all things, also called Iluvatar",
		"gwahir" : "The Lord of the Eagles in Middle-Earth, his name means -wind lord",
		"hithlain" : "A strong, grey, silky material used by the Elves of Lothlorien to make rope. This rope was very light, flexible and robust",
		"ithildin" : "A magical substance made by the Elves from mithril, it can only be seen by the light of the moon and stars, and speaking a magic word",
		"mithril" : "The most precious of metals. Mithril is very light, shines like silver when polished and is stronger than steel",
		"anduril" : "Aragorn's sword, also called the Flame of the West, reforged by the Elves of Rivendell from the shards of Elendil's sword Narsil"
}